In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

In [2]:
from sklearn.model_selection import train_test_split
from sklearn.linear_model import LinearRegression
from sklearn.linear_model import Lasso
from sklearn.linear_model import Ridge

In [7]:
df=pd.read_csv("houseesss.csv")
df

,Area_in_Marla,baths,bedrooms,price,property_type,location,city,purpose
0,4.0,2,2,10000000,Flat,G-10,Islamabad,For Sale
1,5.6,3,3,6900000,Flat,E-11,Islamabad,For Sale
2,8.0,6,5,16500000,House,G-15,Islamabad,For Sale
3,40.0,4,4,43500000,House,Bani Gala,Islamabad,For Sale
4,8.0,3,3,7000000,House,DHA Defence,Islamabad,For Sale
...,...,...,...,...,...,...,...,...
99494,8.0,3,3,7500000,Flat,Bahria Town Karachi,Karachi,For Sale
99495,8.0,4,3,8800000,House,Bahria Town Karachi,Karachi,For Sale
99496,8.0,3,3,14000000,House,Bahria Town Karachi,Karachi,For Sale
99497,14.0,4,4,14000000,House,Bahria Town Karachi,Karachi,For Sale
99498,9.4,3,3,9000000,House,Bahria Town Karachi,Karachi,For Sale

In [8]:
df.isna().sum()

Area_in_Marla    0
baths            0
bedrooms         0
price            0
property_type    0
location         0
city             0
purpose          0
dtype: int64

In [10]:
x=df.iloc[:,:3]
x

       Area_in_Marla  baths  bedrooms
0                4.0      2         2
1                5.6      3         3
2                8.0      6         5
3               40.0      4         4
4                8.0      3         3
...              ...    ...       ...
99494            8.0      3         3
99495            8.0      4         3
99496            8.0      3         3
99497           14.0      4         4
99498            9.4      3         3

[99499 rows x 3 columns]

In [11]:
y=df.iloc[:,3:4]
y

          price
0      10000000
1       6900000
2      16500000
3      43500000
4       7000000
...         ...
99494   7500000
99495   8800000
99496  14000000
99497  14000000
99498   9000000

[99499 rows x 1 columns]

In [41]:
xtrain,xtest,ytrain,ytest=train_test_split(x,y,test_size=0.25,random_state=2)

In [42]:
xtrain.shape

(74624, 3)

In [43]:
ytrain.shape

(74624, 1)

In [44]:
base_reg=LinearRegression()
print("***************Base Regression*********")
print()
print("Training Started....\n")
base_reg.fit(xtrain,ytrain)
print()
base_pred=base_reg.predict(xtest)
from sklearn.metrics import r2_score
print("Base Train_score:\t",base_reg.score(xtrain,ytrain))
print()
print("Base Test Score:\t",base_reg.score(xtest,ytest))
print()
print("R-square:\t",r2_score(ytest,base_pred))
print()

***************Base Regression*********

Training Started....


Base Train_score:	 0.2518533555139112

Base Test Score:	 0.25846043229268156

R-square:	 0.25846043229268156

In [45]:
print("*************Lasso Regression Model*************")
print()
lr=Lasso(alpha=0.01)
lr.fit(xtrain,ytrain)
lr_pred=lr.predict(xtest)
print("Lasso Train_score:\t", lr.score(xtrain,ytrain))
print()
print("Lasso Test_score:\t", lr.score(xtest,ytest))
print()
print("Lasso R-Square:\t",r2_score(ytest,lr_pred))

*************Lasso Regression Model*************

Lasso Train_score:	 0.2518533555139112

Lasso Test_score:	 0.2584604323489794

Lasso R-Square:	 0.2584604323489794

In [49]:
from sklearn.metrics import mean_squared_error
from sklearn.metrics import mean_absolute_error
print('Mean Squared Error: \t', mean_squared_error(ytest, lr_pred))
print()
print('RMSE: \t', np.sqrt(mean_squared_error(ytest, lr_pred)))
print()
print("Mean Absolute Error: \t",mean_absolute_error(ytest,lr_pred))

Mean Squared Error: 	 83914923754351.64

RMSE: 	 9160508.924418535

Mean Absolute Error: 	 6819327.495883697

In [50]:
print("*************Lasso Regression Model*************")
print()
rr=Ridge(alpha=0.01)
rr.fit(xtrain,ytrain)
rr_pred=rr.predict(xtest)
print("Ridge Train_score:\t", rr.score(xtrain,ytrain))
print()
print("Ridge Test_score:\t", rr.score(xtest,ytest))
print()
print("Ridge R-Square:\t",r2_score(ytest,rr_pred))

*************Lasso Regression Model*************

Ridge Train_score:	 0.2518533555139102

Ridge Test_score:	 0.2584604319521223

Ridge R-Square:	 0.2584604319521223

In [51]:
from sklearn.metrics import mean_squared_error
from sklearn.metrics import mean_absolute_error
print('Mean Squared Error: \t', mean_squared_error(ytest, rr_pred))
print()
print('RMSE: \t', np.sqrt(mean_squared_error(ytest, rr_pred)))
print()
print("Mean Absolute Error: \t",mean_absolute_error(ytest,rr_pred))

Mean Squared Error: 	 83914923799261.22

RMSE: 	 9160508.926869797

Mean Absolute Error: 	 6819327.501621262